Vps/VPSCA/test/SubmitLoanTest/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:vps="http://j2ee.netbeans.org/wsdl/VPS/src/VPS" xmlns:xsd1="http://CommonLibrary/xsd">
  <soapenv:Body>
    <vps:SubmitLoanApplicationExposed>
      <user>John Doe</user>
      <Loan>
        <!--Optional:-->
        <xsd1:bank>HSBC</xsd1:bank>
        <!--Optional:-->
        <xsd1:monthlyfare>300</xsd1:monthlyfare>
        <!--Optional:-->
        <xsd1:months>36</xsd1:months>
        <!--Optional:-->
        <xsd1:vehicle>
          <!--Optional:-->
          <xsd1:maker>FIAT</xsd1:maker>
          <!--Optional:-->
          <xsd1:milage>20000</xsd1:milage>
          <!--Optional:-->
          <xsd1:model>Punto</xsd1:model>
          <!--Optional:-->
          <xsd1:price>3000</xsd1:price>
          <!--Optional:-->
          <xsd1:yearofreg>2010</xsd1:yearofreg>
        </xsd1:vehicle>
      </Loan>
      <CardDetails>
        <!--Optional:-->
        <xsd1:cardType>VISA</xsd1:cardType>
        <!--Optional:-->
        <xsd1:cardNumber>1111222233334444</xsd1:cardNumber>
      </CardDetails>
    </vps:SubmitLoanApplicationExposed>
  </soapenv:Body>
</soapenv:Envelope>